name: "3DRecon"
layer{
  name: "gallery"
  type: "Data"
  top: "gallery"
  top: "gallery_label"
  data_param{
    source:"/home/scw4750/github/unrolling/zero/A_net/A_net_by_frontal/data/lmdb/frontal_gallery_lmdb"
    backend: LMDB
    batch_size: 20
  }
  transform_param{
    scale:0.003921	
  }
}
layer{
  name: "probe"
  type: "Data"
  top: "probe"
  top: "probe_label"
  data_param{
    source:"/home/scw4750/github/unrolling/zero/A_net/A_net_by_frontal/data/lmdb/frontal_probe_lmdb"
    backend: LMDB
    batch_size: 20
  }
  transform_param{
    scale:0.007842 	
    mean_value:127.5
  }
}
layer{
  name:"sil"
  type: "Silence"
  bottom:"gallery_label"
}
layer{
  name:"sil2"
  type: "Silence"
  bottom:"probe_label"
}
layer {
  name: "conv11"
  type: "Convolution"
  bottom: "probe"
  top: "conv11"
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "bn_conv11"
  bottom: "conv11"
  top: "conv11"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "scale_conv11"
  bottom: "conv11"
  top: "conv11"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu11"
  type: "ReLU"
  bottom: "conv11"
  top: "conv11"
}

layer {
  name: "conv12"
  type: "Convolution"
  bottom: "conv11"
  top: "conv12"
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "bn_conv12"
  bottom: "conv12"
  top: "conv12"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "scale_conv12"
  bottom: "conv12"
  top: "conv12"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu12"
  type: "ReLU"
  bottom: "conv12"
  top: "conv12"
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv12"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv21"
  type: "Convolution"
  bottom: "pool1"
  top: "conv21"
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "bn_conv21"
  bottom: "conv21"
  top: "conv21"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "scale_conv21"
  bottom: "conv21"
  top: "conv21"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu21"
  type: "ReLU"
  bottom: "conv21"
  top: "conv21"
}

layer {
  name: "conv22"
  type: "Convolution"
  bottom: "conv21"
  top: "conv22"
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "bn_conv22"
  bottom: "conv22"
  top: "conv22"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "scale_conv22"
  bottom: "conv22"
  top: "conv22"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu22"
  type: "ReLU"
  bottom: "conv22"
  top: "conv22"
}

layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv22"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv31"
  type: "Convolution"
  bottom: "pool2"
  top: "conv31"
  convolution_param {
    num_output: 96
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "bn_conv31"
  bottom: "conv31"
  top: "conv31"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "scale_conv31"
  bottom: "conv31"
  top: "conv31"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu31"
  type: "ReLU"
  bottom: "conv31"
  top: "conv31"
}

layer {
  name: "conv32"
  type: "Convolution"
  bottom: "conv31"
  top: "conv32"
  convolution_param {
    num_output: 192
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "bn_conv32"
  bottom: "conv32"
  top: "conv32"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "scale_conv32"
  bottom: "conv32"
  top: "conv32"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu32"
  type: "ReLU"
  bottom: "conv32"
  top: "conv32"
}

layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv32"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 1
  }
}

layer {
  name: "conv41"
  type: "Convolution"
  bottom: "pool3"
  top: "conv41"
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "bn_conv41"
  bottom: "conv41"
  top: "conv41"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "scale_conv41"
  bottom: "conv41"
  top: "conv41"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu41"
  type: "ReLU"
  bottom: "conv41"
  top: "conv41"
}

layer {
  name: "conv42"
  type: "Convolution"
  bottom: "conv41"
  top: "conv42"
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "bn_conv42"
  bottom: "conv42"
  top: "conv42"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "scale_conv42"
  bottom: "conv42"
  top: "conv42"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu42"
  type: "ReLU"
  bottom: "conv42"
  top: "conv42"
}

layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv42"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 1
  }
}

layer {
  name: "conv51"
  type: "Convolution"
  bottom: "pool4"
  top: "conv51"
  convolution_param {
    num_output: 160
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "bn_conv51"
  bottom: "conv51"
  top: "conv51"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "scale_conv51"
  bottom: "conv51"
  top: "conv51"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu51"
  type: "ReLU"
  bottom: "conv51"
  top: "conv51"
}


layer {
  name: "conv52"
  type: "Convolution"
  bottom: "conv51"
  top: "conv52"
  convolution_param {
    num_output: 320
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "bn_conv52"
  bottom: "conv52"
  top: "conv52"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "scale_conv52"
  bottom: "conv52"
  top: "conv52"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv52"
  top: "pool5"
  pooling_param {
    pool: AVE
    kernel_size: 7
  }
}

layer {
  name: "drop5"
  bottom: "pool5"
  top: "pool5"  
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.4
  }
}

layer {
  name: "fc6_m"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6_m"
  inner_product_param {
    num_output: 8
  }
}

layer {
  name: "fc6_shape"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6_shape"
  inner_product_param {
    num_output: 199
  }
}

layer {
  name: "fc6_exp"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6_exp"
  inner_product_param {
    num_output: 29
  }
}

layer {
  name: "fc6_tex"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6_tex"
  inner_product_param {
    num_output: 40
  }
}
layer{
  name: "silence_fc6_txt"
  type: "Silence"
  bottom: "fc6_tex"
}

###A_net####
###R_net 1####
layer {
  name: "frontal"
  type: "Frontal"
  bottom: "probe"
  bottom: "fc6_shape"
  bottom: "fc6_exp"
  bottom: "fc6_m"
  top: "frontal"
  propagate_down : 0
  propagate_down : 1
  propagate_down : 1
  propagate_down : 1
  frontal_param {
    frontal_h: 128
    frontal_w: 128
    mean_shape: "/home/scw4750/github/unrolling/zero/test_unrolling_layer/Model_txt/mean_shape.txt"
    shape_basis: "/home/scw4750/github/unrolling/zero/test_unrolling_layer/Model_txt/model_shape/shape_basis_0"
    mean_exp: "/home/scw4750/github/unrolling/zero/test_unrolling_layer/Model_txt/mean_exp.txt"
    exp_basis: "/home/scw4750/github/unrolling/zero/test_unrolling_layer/Model_txt/exp_basis.txt"
    para_std: "/home/scw4750/github/unrolling/zero/test_unrolling_layer/Model_txt/para_std.txt"
    para_mean: "/home/scw4750/github/unrolling/zero/test_unrolling_layer/Model_txt/para_mean.txt"
    tvi:"/home/scw4750/github/unrolling/zero/test_unrolling_layer/Model_txt/part_face.txt"
    part_index: "/home/scw4750/github/unrolling/zero/test_unrolling_layer/Model_txt/part_index.txt"
    mean_lm2:"/home/scw4750/github/unrolling/zero/test_unrolling_layer/Model_txt/mean_lm2.txt" 
    shape_basis_index:"/home/scw4750/github/unrolling/zero/test_unrolling_layer/Model_txt/shape_basis_index.txt"
    vertices_num:159645
    is_gray: true
    has_processed: true
  }
}
layer{
  name:"loss"
  bottom: "gallery"
  bottom: "frontal"
  type: "EuclideanLoss"
  top:"loss"
}
